# Pandas practice

In [1]:
import numpy as np
import pandas as pd

In [2]:
dict={
    'name':['Brijesh','nisarg','pratik'],
    'marks':[48,49,50],
    'city':['s.nagar','abad','kadi']
}

In [3]:
df=pd.DataFrame(dict)

In [4]:
df

      name  marks     city
0  Brijesh     48  s.nagar
1   nisarg     49     abad
2   pratik     50     kadi

In [5]:
# to convert data into csv
df.to_csv('abc.csv')

In [6]:
df.head()

      name  marks     city
0  Brijesh     48  s.nagar
1   nisarg     49     abad
2   pratik     50     kadi

In [7]:
df.tail()

      name  marks     city
0  Brijesh     48  s.nagar
1   nisarg     49     abad
2   pratik     50     kadi

In [8]:
df.describe()

       marks
count    3.0
mean    49.0
std      1.0
min     48.0
25%     48.5
50%     49.0
75%     49.5
max     50.0

In [9]:
df1=pd.read_csv('abc.csv')

In [10]:
df1

   Unnamed: 0     name  marks     city
0           0  Brijesh     48  s.nagar
1           1   nisarg     49     abad
2           2   pratik     50     kadi

In [11]:
# df1.speed

In [12]:
df1['speed'][0]=50

KeyError: 'speed'

In [13]:
df1.index=['one','two','three']

In [14]:
df1

       Unnamed: 0     name  marks     city
one             0  Brijesh     48  s.nagar
two             1   nisarg     49     abad
three           2   pratik     50     kadi

In [15]:
df2=pd.read_csv('uber.csv')

In [16]:
df2.head(5)

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,01-01-2016 21:11,01-01-2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,01-02-2016 01:25,01-02-2016 01:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,01-02-2016 20:25,01-02-2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,01-05-2016 17:31,01-05-2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,01-06-2016 14:42,01-06-2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

In [17]:
df2

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,01-01-2016 21:11,01-01-2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,01-02-2016 01:25,01-02-2016 01:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,01-02-2016 20:25,01-02-2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,01-05-2016 17:31,01-05-2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,01-06-2016 14:42,01-06-2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit
...,...,...,...,...,...,...,...
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Kar?chi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN

# diff between dataframe and series

In [19]:
ser=pd.Series(np.random.rand(5))
type(ser)

pandas.core.series.Series

In [22]:
newdf=pd.DataFrame(np.random.rand(5))
type(newdf)

pandas.core.frame.DataFrame

In [23]:
newdf=pd.DataFrame(np.random.rand(330,5),index=np.arange(330))

In [24]:
newdf

            0         1         2         3         4
0    0.738208  0.851182  0.850846  0.868220  0.435139
1    0.350079  0.950099  0.325580  0.925030  0.280490
2    0.770822  0.641538  0.679569  0.439361  0.481277
3    0.651688  0.797482  0.743275  0.597635  0.739386
4    0.740631  0.749850  0.842315  0.237981  0.902095
..        ...       ...       ...       ...       ...
325  0.319183  0.316744  0.069352  0.727235  0.641301
326  0.126480  0.840127  0.211625  0.519069  0.405703
327  0.838806  0.992204  0.743734  0.029891  0.249676
328  0.979315  0.321688  0.035102  0.902016  0.426981
329  0.497037  0.923357  0.253446  0.547844  0.329556

[330 rows x 5 columns]

In [25]:
newdf.describe()

                0           1           2           3           4
count  330.000000  330.000000  330.000000  330.000000  330.000000
mean     0.497681    0.510552    0.488518    0.482448    0.509846
std      0.297536    0.284029    0.293811    0.283286    0.274741
min      0.000364    0.000807    0.000058    0.004918    0.007855
25%      0.208057    0.275873    0.234922    0.238159    0.293059
50%      0.504323    0.510492    0.479875    0.469667    0.496901
75%      0.736533    0.742307    0.750557    0.720023    0.752772
max      0.999262    0.999981    0.999187    0.991618    0.977729

In [26]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [27]:
# df2.dtypes

START_DATE*     object
END_DATE*       object
CATEGORY*       object
START*          object
STOP*           object
MILES*         float64
PURPOSE*        object
dtype: object

In [31]:
newdf[0][0]='brijesh'
newdf.dtypes
newdf

            0         1         2         3         4
0     brijesh  0.851182  0.850846  0.868220  0.435139
1    0.350079  0.950099  0.325580  0.925030  0.280490
2    0.770822  0.641538  0.679569  0.439361  0.481277
3    0.651688  0.797482  0.743275  0.597635  0.739386
4    0.740631  0.749850  0.842315  0.237981  0.902095
..        ...       ...       ...       ...       ...
325  0.319183  0.316744  0.069352  0.727235  0.641301
326   0.12648  0.840127  0.211625  0.519069  0.405703
327  0.838806  0.992204  0.743734  0.029891  0.249676
328  0.979315  0.321688  0.035102  0.902016  0.426981
329  0.497037  0.923357  0.253446  0.547844  0.329556

[330 rows x 5 columns]

In [32]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            320, 321, 322, 323, 324, 325, 326, 327, 328, 329],
           dtype='int64', length=330)

In [33]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [35]:
newdf[0][0]=0.738208
newdf

            0         1         2         3         4
0    0.738208  0.851182  0.850846  0.868220  0.435139
1    0.350079  0.950099  0.325580  0.925030  0.280490
2    0.770822  0.641538  0.679569  0.439361  0.481277
3    0.651688  0.797482  0.743275  0.597635  0.739386
4    0.740631  0.749850  0.842315  0.237981  0.902095
..        ...       ...       ...       ...       ...
325  0.319183  0.316744  0.069352  0.727235  0.641301
326   0.12648  0.840127  0.211625  0.519069  0.405703
327  0.838806  0.992204  0.743734  0.029891  0.249676
328  0.979315  0.321688  0.035102  0.902016  0.426981
329  0.497037  0.923357  0.253446  0.547844  0.329556

[330 rows x 5 columns]

In [36]:
newdf.to_numpy()

array([[0.738208, 0.8511821005131587, 0.8508460349169299,
        0.8682202722235414, 0.4351390214996643],
       [0.3500785973757713, 0.9500987872927326, 0.3255799517370974,
        0.9250300834821085, 0.28048999257458695],
       [0.7708223967487488, 0.6415378133401755, 0.6795689260630847,
        0.43936053970454725, 0.4812766790817806],
       ...,
       [0.8388064641483218, 0.9922042754896738, 0.7437339310815335,
        0.029890924606774893, 0.24967604768973872],
       [0.9793149575972591, 0.3216881458051013, 0.03510216167242053,
        0.9020157044687929, 0.4269813442504832],
       [0.4970365200548773, 0.923357304245127, 0.2534455947771711,
        0.5478441874322023, 0.32955623443153115]], dtype=object)

In [39]:
type(newdf)

pandas.core.frame.DataFrame

In [41]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,320,321,322,323,324,325,326,327,328,329
0,0.738208,0.350079,0.770822,0.651688,0.740631,0.960231,0.291444,0.499102,0.537894,0.933687,...,0.404443,0.111484,0.922338,0.718491,0.140658,0.319183,0.12648,0.838806,0.979315,0.497037
1,0.851182,0.950099,0.641538,0.797482,0.74985,0.264569,0.309098,0.013356,0.886589,0.720105,...,0.588772,0.105292,0.665036,0.41281,0.663177,0.316744,0.840127,0.992204,0.321688,0.923357
2,0.850846,0.32558,0.679569,0.743275,0.842315,0.7262,0.675626,0.486005,0.804611,0.61065,...,0.655057,0.590254,0.572347,0.486194,0.879058,0.069352,0.211625,0.743734,0.035102,0.253446
3,0.86822,0.92503,0.439361,0.597635,0.237981,0.462923,0.18041,0.243882,0.876718,0.395273,...,0.014007,0.124977,0.159642,0.733119,0.913925,0.727235,0.519069,0.029891,0.902016,0.547844
4,0.435139,0.28049,0.481277,0.739386,0.902095,0.058717,0.023545,0.532745,0.43627,0.123555,...,0.16268,0.129241,0.345516,0.640346,0.735283,0.641301,0.405703,0.249676,0.426981,0.329556

In [43]:
newdf.head()

          0         1         2         3         4
0  0.738208  0.851182  0.850846  0.868220  0.435139
1  0.350079  0.950099  0.325580  0.925030  0.280490
2  0.770822  0.641538  0.679569  0.439361  0.481277
3  0.651688  0.797482  0.743275  0.597635  0.739386
4  0.740631  0.749850  0.842315  0.237981  0.902095

In [45]:
newdf.sort_index(axis=1,ascending=False)

            4         3         2         1         0
0    0.435139  0.868220  0.850846  0.851182  0.738208
1    0.280490  0.925030  0.325580  0.950099  0.350079
2    0.481277  0.439361  0.679569  0.641538  0.770822
3    0.739386  0.597635  0.743275  0.797482  0.651688
4    0.902095  0.237981  0.842315  0.749850  0.740631
..        ...       ...       ...       ...       ...
325  0.641301  0.727235  0.069352  0.316744  0.319183
326  0.405703  0.519069  0.211625  0.840127   0.12648
327  0.249676  0.029891  0.743734  0.992204  0.838806
328  0.426981  0.902016  0.035102  0.321688  0.979315
329  0.329556  0.547844  0.253446  0.923357  0.497037

[330 rows x 5 columns]

In [49]:
 type(newdf[0])

pandas.core.series.Series

In [50]:
abc=newdf[0]

In [53]:
newdf[0][0]=20000

In [54]:
# type(abc)
abc

0         20000
1      0.350079
2      0.770822
3      0.651688
4      0.740631
         ...
325    0.319183
326     0.12648
327    0.838806
328    0.979315
329    0.497037
Name: 0, Length: 330, dtype: object

In [57]:
newdf.columns=list('ABCDE')
newdf

            A         B         C         D         E
0       20000  0.851182  0.850846  0.868220  0.435139
1    0.350079  0.950099  0.325580  0.925030  0.280490
2    0.770822  0.641538  0.679569  0.439361  0.481277
3    0.651688  0.797482  0.743275  0.597635  0.739386
4    0.740631  0.749850  0.842315  0.237981  0.902095
..        ...       ...       ...       ...       ...
325  0.319183  0.316744  0.069352  0.727235  0.641301
326   0.12648  0.840127  0.211625  0.519069  0.405703
327  0.838806  0.992204  0.743734  0.029891  0.249676
328  0.979315  0.321688  0.035102  0.902016  0.426981
329  0.497037  0.923357  0.253446  0.547844  0.329556

[330 rows x 5 columns]

In [60]:
newdf.loc[0,0]=20
newdf

            A         B         C         D         E     0
0          20  0.851182  0.850846  0.868220  0.435139  20.0
1    0.350079  0.950099  0.325580  0.925030  0.280490   NaN
2    0.770822  0.641538  0.679569  0.439361  0.481277   NaN
3    0.651688  0.797482  0.743275  0.597635  0.739386   NaN
4    0.740631  0.749850  0.842315  0.237981  0.902095   NaN
..        ...       ...       ...       ...       ...   ...
325  0.319183  0.316744  0.069352  0.727235  0.641301   NaN
326   0.12648  0.840127  0.211625  0.519069  0.405703   NaN
327  0.838806  0.992204  0.743734  0.029891  0.249676   NaN
328  0.979315  0.321688  0.035102  0.902016  0.426981   NaN
329  0.497037  0.923357  0.253446  0.547844  0.329556   NaN

[330 rows x 6 columns]

In [61]:
newdf.drop(0,axis=1)

            A         B         C         D         E
0          20  0.851182  0.850846  0.868220  0.435139
1    0.350079  0.950099  0.325580  0.925030  0.280490
2    0.770822  0.641538  0.679569  0.439361  0.481277
3    0.651688  0.797482  0.743275  0.597635  0.739386
4    0.740631  0.749850  0.842315  0.237981  0.902095
..        ...       ...       ...       ...       ...
325  0.319183  0.316744  0.069352  0.727235  0.641301
326   0.12648  0.840127  0.211625  0.519069  0.405703
327  0.838806  0.992204  0.743734  0.029891  0.249676
328  0.979315  0.321688  0.035102  0.902016  0.426981
329  0.497037  0.923357  0.253446  0.547844  0.329556

[330 rows x 5 columns]